# Value Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyDouble..::..Value Property
AssetPropertyDouble Class See Also
---
The value of the property.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Value { get; set; }
```

Visual Basic
---
```text
Public Property Value As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Value {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The input value is invalid for this AssetPropertyDouble property. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The asset property is not editable. |

# See Also
AssetPropertyDouble Class
Autodesk.Revit.DB.Visual Namespace